{
  "quotes": [
    "The only way to do great work is to love what you do. - Steve Jobs",
    "Code is poetry written in a language computers understand. - Unknown",
    "Perfect is the enemy of good. - Voltaire",
    "First, solve the problem. Then, write the code. - John Johnson",
    "Debugging is like being the detective in a crime drama. - Filipe Fortes",
    "Any fool can write code. The art is writing code that humans can understand. - Martin Fowler",
    "The most effective debugging tool is still careful thought. - Brian W. Kernighan",
    "Premature optimization is the root of all evil. - Donald Knuth",
    "Make it work, make it right, make it fast. - Kent Beck",
    "Simplicity is the ultimate sophistication. - Leonardo da Vinci",
    "Don't reinvent the wheel. - Common wisdom",
    "Keep it simple, stupid. - KISS Principle",
    "Write code as if the next person to read it is a serial killer. - Unknown",
    "Bad code ruins everything. Good code makes everything possible. - Unknown",
    "You are not your code. Don't take it personally. - Unknown",
    "Code reviews are conversations. - Unknown",
    "The best code is the code you don't have to write. - Unknown",
    "Function names should tell you why they exist and what they do. - Robert Martin",
    "Don't comment bad code—rewrite it. - Brian W. Kernighan",
    "Measure twice, code once. - Unknown",
    "Every expert was once a beginner. - Unknown",
    "Clean code always looks like it was written by someone who cares. - Robert C. Martin",
    "The real problem is that programmers have spent far too much time worrying about efficiency. - Donald Knuth"
  ],
  "techTips": [
    "Use version control for everything. Git is your friend!",
    "Write tests before you write code (TDD). It saves time!",
    "Comment your why, not your what. Code shows what, comments show why!",
    "Keep functions small and focused on one thing!",
    "DRY principle: Don't Repeat Yourself!",
    "Refactor regularly to keep your codebase healthy!",
    "Learn your IDE shortcuts—it will save hours!",
    "Use meaningful variable names that describe their purpose!",
    "Document APIs and complex algorithms!",
    "Review other people's code to learn new techniques!",
    "Use linters to catch bugs before runtime!",
    "Performance matters, but readable code matters more!",
    "Always handle edge cases and errors gracefully!",
    "Automate repetitive tasks with scripts!",
    "Stay curious and keep learning new technologies!",
    "Break complex problems into smaller, manageable pieces.",
    "Use consistent naming conventions across your codebase.",
    "Write code for humans first, computers second."
  ]
}
